In [1]:
import matplotlib
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
df_train = pd.read_csv(r'C:\Users\dhamane\MachineLearning-master\data\train.csv')

In [3]:
df_test = pd.read_csv(r'C:\Users\dhamane\MachineLearning-master\data\test.csv')

In [4]:
df_train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [5]:
df_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [6]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
User_ID                       550068 non-null int64
Product_ID                    550068 non-null object
Gender                        550068 non-null object
Age                           550068 non-null object
Occupation                    550068 non-null int64
City_Category                 550068 non-null object
Stay_In_Current_City_Years    550068 non-null object
Marital_Status                550068 non-null int64
Product_Category_1            550068 non-null int64
Product_Category_2            376430 non-null float64
Product_Category_3            166821 non-null float64
Purchase                      550068 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [7]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
User_ID                       233599 non-null int64
Product_ID                    233599 non-null object
Gender                        233599 non-null object
Age                           233599 non-null object
Occupation                    233599 non-null int64
City_Category                 233599 non-null object
Stay_In_Current_City_Years    233599 non-null object
Marital_Status                233599 non-null int64
Product_Category_1            233599 non-null int64
Product_Category_2            161255 non-null float64
Product_Category_3            71037 non-null float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

In [8]:
#Check for any null values
df_train.isna().any()

User_ID                       False
Product_ID                    False
Gender                        False
Age                           False
Occupation                    False
City_Category                 False
Stay_In_Current_City_Years    False
Marital_Status                False
Product_Category_1            False
Product_Category_2             True
Product_Category_3             True
Purchase                      False
dtype: bool

In [9]:
#Check for any null values
df_test.isna().any()

User_ID                       False
Product_ID                    False
Gender                        False
Age                           False
Occupation                    False
City_Category                 False
Stay_In_Current_City_Years    False
Marital_Status                False
Product_Category_1            False
Product_Category_2             True
Product_Category_3             True
dtype: bool

In [10]:
#Fill the null values with 0

df_train.fillna(0, inplace= True)

In [11]:
df_train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,0.0,0.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,0.0,0.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,0.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,0.0,0.0,7969

In [12]:
#Fill the null values with 0

df_test.fillna(0, inplace= True)

In [13]:
df_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,0.0
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,0.0
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,0.0
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,0.0
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [14]:
df_train = df_train.astype({'Product_Category_2': int, 'Product_Category_3': int})

In [15]:
df_test = df_test.astype({'Product_Category_2': int, 'Product_Category_3': int})

In [16]:
df_train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,0,0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6,14,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,0,0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14,0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,0,0,7969

In [17]:
df_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11,0
1,1000009,P00113442,M,26-35,17,C,0,0,3,5,0
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14,0
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9,0
4,1000011,P00053842,F,26-35,1,C,1,0,4,5,12

In [18]:
#Mapping gender values
gender = {'F':0, 'M':1}

df_train['Gender'] = df_train['Gender'].map(gender)
df_train = df_train.rename(columns={'Gender': 'isMale'})

In [19]:
df_train.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,0-17,10,A,2,0,3,0,0,8370
1,1000001,P00248942,0,0-17,10,A,2,0,1,6,14,15200
2,1000001,P00087842,0,0-17,10,A,2,0,12,0,0,1422
3,1000001,P00085442,0,0-17,10,A,2,0,12,14,0,1057
4,1000002,P00285442,1,55+,16,C,4+,0,8,0,0,7969

In [20]:
#Mapping gender values
gender = {'F':0, 'M':1}

df_test['Gender'] = df_test['Gender'].map(gender)
df_test = df_test.rename(columns={'Gender': 'isMale'})

In [21]:
df_test.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,1,46-50,7,B,2,1,1,11,0
1,1000009,P00113442,1,26-35,17,C,0,0,3,5,0
2,1000010,P00288442,0,36-45,1,B,4+,1,5,14,0
3,1000010,P00145342,0,36-45,1,B,4+,1,4,9,0
4,1000011,P00053842,0,26-35,1,C,1,0,4,5,12

In [22]:
df_train.sort_values('Age', inplace=True)
df_train.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,0-17,10,A,2,0,3,0,0,8370
48932,1001499,P00100442,1,0-17,10,C,1,0,2,4,5,13129
48933,1001499,P00255842,1,0-17,10,C,1,0,16,0,0,20195
48934,1001499,P00070342,1,0-17,10,C,1,0,1,2,14,15819
48935,1001499,P00275542,1,0-17,10,C,1,0,1,0,0,7587

In [23]:
df_test.sort_values('Age', inplace=True)
df_test.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
98919,1002288,P00127642,1,0-17,10,B,2,0,1,2,15
178852,1005524,P00249142,0,0-17,10,B,1,0,5,0,0
20745,1002042,P00241442,1,0-17,10,C,4+,0,2,15,0
93911,1000753,P00075642,1,0-17,10,C,1,0,4,5,0
93910,1000753,P00116742,1,0-17,10,C,1,0,11,0,0

**Mapping Age column to dummy values:**

0-17: 0<br>
18-25: 1<br>
26-35: 2<br>
36-45: 3<br>
46-50: 4<br>
51-55: 5<br>
55+ : 6<br>

In [24]:
df_train['Age'] = df_train['Age'].factorize()[0]

In [25]:
df_train.tail()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
47161,1001252,P00357242,1,6,13,C,3,0,5,0,0,7134
47162,1001252,P00322942,1,6,13,C,3,0,2,8,16,16325
114629,1005686,P00101942,1,6,16,A,1,1,8,17,0,4056
188070,1005033,P00112342,0,6,13,C,1,1,13,16,0,936
132077,1002280,P00004142,1,6,6,B,2,1,8,17,0,7900

In [26]:
df_test['Age'] = df_test['Age'].factorize()[0]

df_test.tail()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
147760,1005313,P00346242,1,6,0,A,3,0,1,15,0
219148,1001870,P00026042,1,6,13,C,1,0,8,14,17
106713,1002297,P00003442,1,6,13,C,4+,1,4,5,8
201827,1005273,P00100142,1,6,20,B,3,1,10,16,0
156177,1000444,P00318742,1,6,0,A,3,0,1,8,0

In [27]:
# Mapping city to numeric values
city = {'A': 1, 'B': 2, 'C':3}

df_train['City_Category'] = df_train['City_Category'].map(city)

df_train.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,0,10,1,2,0,3,0,0,8370
48932,1001499,P00100442,1,0,10,3,1,0,2,4,5,13129
48933,1001499,P00255842,1,0,10,3,1,0,16,0,0,20195
48934,1001499,P00070342,1,0,10,3,1,0,1,2,14,15819
48935,1001499,P00275542,1,0,10,3,1,0,1,0,0,7587

In [28]:
# Mapping city to numeric values
df_test['City_Category'] = df_test['City_Category'].map(city)

df_test.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
98919,1002288,P00127642,1,0,10,2,2,0,1,2,15
178852,1005524,P00249142,0,0,10,2,1,0,5,0,0
20745,1002042,P00241442,1,0,10,3,4+,0,2,15,0
93911,1000753,P00075642,1,0,10,3,1,0,4,5,0
93910,1000753,P00116742,1,0,10,3,1,0,11,0,0

In [29]:
df_train['Stay_In_Current_City_Years'].replace({'4+': 4}, inplace=True)
df_train.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,0,10,1,2,0,3,0,0,8370
48932,1001499,P00100442,1,0,10,3,1,0,2,4,5,13129
48933,1001499,P00255842,1,0,10,3,1,0,16,0,0,20195
48934,1001499,P00070342,1,0,10,3,1,0,1,2,14,15819
48935,1001499,P00275542,1,0,10,3,1,0,1,0,0,7587

In [30]:
df_test['Stay_In_Current_City_Years'].replace({'4+': 4}, inplace=True)
df_test.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
98919,1002288,P00127642,1,0,10,2,2,0,1,2,15
178852,1005524,P00249142,0,0,10,2,1,0,5,0,0
20745,1002042,P00241442,1,0,10,3,4,0,2,15,0
93911,1000753,P00075642,1,0,10,3,1,0,4,5,0
93910,1000753,P00116742,1,0,10,3,1,0,11,0,0

In [31]:
df_train['Product_ID'] = df_train['Product_ID'].str[1:] # Drop the first character P from product id
df_train = df_train.astype({'Product_ID':int,'Stay_In_Current_City_Years':int}) # Recast all strings as ints

df_train.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,69042,0,0,10,1,2,0,3,0,0,8370
48932,1001499,100442,1,0,10,3,1,0,2,4,5,13129
48933,1001499,255842,1,0,10,3,1,0,16,0,0,20195
48934,1001499,70342,1,0,10,3,1,0,1,2,14,15819
48935,1001499,275542,1,0,10,3,1,0,1,0,0,7587

In [32]:
df_test['Product_ID'] = df_test['Product_ID'].str[1:] # Drop the first character P from product id
df_test = df_test.astype({'Product_ID':int,'Stay_In_Current_City_Years':int}) # Recast all strings as ints

df_test.head()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
98919,1002288,127642,1,0,10,2,2,0,1,2,15
178852,1005524,249142,0,0,10,2,1,0,5,0,0
20745,1002042,241442,1,0,10,3,4,0,2,15,0
93911,1000753,75642,1,0,10,3,1,0,4,5,0
93910,1000753,116742,1,0,10,3,1,0,11,0,0

In [33]:
df_train.corr()

,User_ID,Product_ID,isMale,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
User_ID,1.000000,-0.017619,-0.033474,0.032698,-0.023971,0.022859,-0.030737,0.020443,0.003825,0.003896,0.003605,0.004716
Product_ID,-0.017619,1.000000,0.021084,0.028892,0.009344,0.010162,-0.003162,0.013194,0.090193,-0.090600,-0.144360,-0.103961
isMale,-0.033474,0.021084,1.000000,-0.004262,0.117291,-0.004515,0.014660,-0.011603,-0.045594,-0.000954,0.036146,0.060346
Age,0.032698,0.028892,-0.004262,1.000000,0.091463,0.123079,-0.004712,0.311738,0.061197,0.018770,-0.007422,0.015839
Occupation,-0.023971,0.009344,0.117291,0.091463,1.000000,0.034479,0.030005,0.024280,-0.007618,0.006712,0.012269,0.020833
City_Category,0.022859,0.010162,-0.004515,0.123079,0.034479,1.000000,0.019946,0.039790,-0.014364,0.016003,0.035525,0.061914
Stay_In_Current_City_Years,-0.030737,-0.003162,0.014660,-0.004712,0.030005,0.019946,1.000000,-0.012819,-0.004213,0.001262,0.001977,0.005422
Marital_Status,0.020443,0.013194,-0.011603,0.311738,0.024280,0.039790,-0.012819,1.000000,0.019888,0.001099,-0.004629,-0.000463
Product_Category_1,0.003825,0.090193,-0.045594,0.061197,-0.007618,-0.014364,-0.004213,0.019888,1.000000,-0.067877,-0.385534,-0.343703
Product_Category_2,0.003896,-0.090600,-0.000954,0.018770,0.006712,0.016003,0.001262,0.001099,-0.067877,1.000000,0.094750,0.052288
Product_Category_3,0.003605,-0.144360,0.036146,-0.007422,0.012269,0.035525,0.001977,-0.004629,-0.385534,0.094750,1.000000,0.288501
Purchase,0.004716,-0.103961,0.060346,0.015839,0.020833,0.061914,0.005422,-0.000463,-0.343703,0.052288,0.288501,1.000000

In [34]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

X_values = df_train.drop(columns=['Purchase'])
y_values = df_train['Purchase']
scaler = StandardScaler()

X_train, X_test, y_train, y_test = train_test_split(X_values, y_values,test_size=0.20, random_state=42)

scaler.fit(X_train)

X_train_ts = scaler.transform(X_train)
X_test_ts = scaler.transform(X_test)

In [ ]:
X_train.info()

In [ ]:
df_train.info()

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

X_values = df.drop(columns=['Purchase', 'User_ID', 'Product_ID'])
y_values = df['Purchase']
scaler = StandardScaler()

X_train, X_test, y_train, y_test = train_test_split(X_values, y_values,test_size=0.20, random_state=42)

scaler.fit(X_train)

X_train_ts = scaler.transform(X_train)
X_test_ts = scaler.transform(X_test)

In [ ]:
randomForest = rfr.fit(X_train_ts,y_train)

In [ ]:
y_pred = rfr.predict(scaler.transform(X_test))

In [ ]:
rfr.score(X_train_ts,y_train)*100

In [ ]:
rfr.score(X_test_ts,y_test)*100

In [ ]:
from sklearn.metrics import mean_squared_error
import math

np.sqrt(mean_squared_error(y_test, y_pred))

In [ ]:
from sklearn import metrics

metrics.mean_absolute_error(y_test, y_pred)

In [ ]:
df['Purchase'].mean()

In [39]:
from sklearn.model_selection import RandomizedSearchCV
# Number of trees in random forest
n_estimators = [int(x) for x in np.linspace(start = 200, stop = 200, num = 5)]
# Number of features to consider at every split
max_features = ['auto']
# Maximum number of levels in tree
max_depth = [int(x) for x in np.linspace(2,15, num=14)]
max_depth.append(None)
# Minimum number of samples required to split a node
min_samples_split = [2, 5, 10]
# Minimum number of samples required at each leaf node
min_samples_leaf = [2, 4, 6, 8, 10]
# Method of selecting samples for training each tree
bootstrap = [True]
# Create the random grid
random_grid = {'n_estimators': n_estimators,
               'max_features': max_features,
               'max_depth': max_depth,
               'min_samples_split': min_samples_split,
               'min_samples_leaf': min_samples_leaf,
               'bootstrap': bootstrap}
print(random_grid)

{'n_estimators': [200, 200, 200, 200, 200], 'max_features': ['auto'], 'max_depth': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, None], 'min_samples_split': [2, 5, 10], 'min_samples_leaf': [2, 4, 6, 8, 10], 'bootstrap': [True]}

In [41]:
# Use the random grid to search for best hyperparameters
# First create the base model to tune
from sklearn.ensemble import RandomForestRegressor

rf = RandomForestRegressor(n_estimators=100)
# Random search of parameters, using 3 fold cross validation, 
# search across 100 different combinations, and use all available cores
rf_random = RandomizedSearchCV(estimator = rf, param_distributions = random_grid, n_iter = 100, cv = 3, 
                               verbose=2, random_state=42, n_jobs = -1)
# Fit the random search model
rf_random.fit(X_train_ts, y_train)

Fitting 3 folds for each of 100 candidates, totalling 300 fits

[Parallel(n_jobs=-1)]: Done  25 tasks      | elapsed: 28.0min
[Parallel(n_jobs=-1)]: Done 146 tasks      | elapsed: 93.0min
[Parallel(n_jobs=-1)]: Done 300 out of 300 | elapsed: 174.9min finished

RandomizedSearchCV(cv=3, error_score='raise',
          estimator=RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=100, n_jobs=1,
           oob_score=False, random_state=None, verbose=0, warm_start=False),
          fit_params=None, iid=True, n_iter=100, n_jobs=-1,
          param_distributions={'n_estimators': [200, 200, 200, 200, 200], 'max_features': ['auto'], 'max_depth': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, None], 'min_samples_split': [2, 5, 10], 'min_samples_leaf': [2, 4, 6, 8, 10], 'bootstrap': [True]},
          pre_dispatch='2*n_jobs', random_state=42, refit=True,
          return_train_score='warn', scoring=None, verbose=2)

In [42]:
rf_random.best_estimator_

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=10, min_samples_split=5,
           min_weight_fraction_leaf=0.0, n_estimators=200, n_jobs=1,
           oob_score=False, random_state=None, verbose=0, warm_start=False)

In [44]:
rf_random.best_params_

{'n_estimators': 200,
 'min_samples_split': 5,
 'min_samples_leaf': 10,
 'max_features': 'auto',
 'max_depth': None,
 'bootstrap': True}

In [49]:
y_pred = rf_random.predict(scaler.transform(X_test))

In [47]:
from sklearn.metrics import mean_squared_error
import math

np.sqrt(mean_squared_error(y_test, y_pred))

2668.9841336786503

In [55]:
df_train['Purchase'].values.mean()

9263.968712959126

In [50]:
from sklearn.ensemble import RandomForestRegressor

rfr = RandomForestRegressor(n_estimators = 200)

In [56]:
rf_all = rfr.fit(X_train_ts,y_train)

In [57]:
y_pred1 = rfr.predict(X_test_ts)

In [58]:
np.sqrt(mean_squared_error(y_test, y_pred1))

2725.6482327665017